perf/root.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Pruebo 
      duration: 30
      arrivalRate: 20
      rampTo: 600
    - name: Pruebo 
      duration: 40
      arrivalRate: 20
      rampTo: 800
    
scenarios:
  - name: Ping - Stress
    flow:
      - get:
          url: '/ping'